---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wave.WaveColor1
source: html/1765500b-9e5d-5a13-097f-23127c82359f.htm
---
# Autodesk.Revit.DB.Visual.Wave.WaveColor1 Property

The property labeled "Color 1" from the "Wave" schema.

## Syntax (C#)
```csharp
public static string WaveColor1 { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.